{
  "title": "OpenLaw NZ News",
  "items": [
      {
          "id": "1",
          "title": "OpenLaw NZ launches new website",
          "summary": "Welcome to our new website. We're really excited to release an improved web and mobile experience. We have also imported another 14,000 cases, and improved our data parsing technology.",
          "content_html": "<p>With the help of our awesome volunteer team, today we launch our website redesign!<\/p><p>The new website adds a much improved design and user interface. The site is also responsive, which makes it much easier to use on a mobile device. The search functionality has been upgraded to add pagination, and a new case display page.<\/p><p>We've also been working behind the scenes with our case law API and data pipeline. We have upgraded the API technology (including a new interface that allows you to explore API queries), added automatic extraction of Court information, overhauled our case to legislation algorithm, and migrated our database from mySQL to PostgreSQL.<\/p><p>All credit goes to our current volunteers: April Liau for the designs, Blaine Western leading the front end web team (including Caio Navarro, Tian Bai, and Hanbyul Son), our API expert Noel Soong, and our data parsing and devops volunteers Ed Haslam, Alex Chan, and Limei Wang.",
          "image_url": "https://s3-ap-southeast-2.amazonaws.com/assets.openlaw.nz/openlaw-full-logo.png",
          "date": "2019-09-11T00:00:00+12:00",
          "formattedDate": "13 September 2019"
      },
      {
          "id": "2",
          "title": "Amazing response to call for volunteers",
          "summary": "In July 2019, OpenLaw NZ put out a call for volunteers who would be interested in helping contribute to the platform. We sought front end web developers, people experienced with data parsing and machine learning, devops and infrastructure, design and law students or lawyers. The response was fantastic and we now have a team of 20 volunteers.",
          "content_html": "<p>In July 2019, OpenLaw NZ put out a call for volunteers who would be interested in helping contribute to the platform. We sought front end web developers, people experienced with data parsing and machine learning, devops and infrastructure, design and law students or lawyers.<\/p><p>The response has been fantastic. In three months, we’ve brought on a team of 20 committed volunteers, each with a set of skills and experience that has been invaluable in building additional functionality.<\/p><p>Some of the team’s recent accomplishments are: <ul \/><li>The website has been redesigned to what you see today and built using custom React components<\/li><li>Our data parser and pipeline is being set up to run on multiple cloud instances simultaneously to reduce the processing time from a week to a few hours<\/li><li>Our database has been migrated from mySQL to Postgres, and our API software has been migrated and improved.<\/li><\/ul><\/p><p>You can read more about our volunteers on our <a href=\"\/about\">about page.<\/a><\/p>",
          "image_url": "https://s3-ap-southeast-2.amazonaws.com/assets.openlaw.nz/alexhuang.jpg",
          "date": "2019-09-11T00:00:00+12:00",
          "formattedDate": "13 September 2019"
      }
  ]

}