{
  "title": "OpenLaw NZ News",
  "items": [
    {
        "id": "1",
        "title": "OpenLaw NZ Receives Law Foundation Grant",
        "summary": "The New Zealand Law Foundation has funded a joint project between OpenLaw NZ and researchers Tom Barraclough, Curtis Barnes and Warren Forster to apply automated technologies and analytics to case law to enhance access to justice.",
        "content_html": "<p>The New Zealand Law Foundation has <a href=\"https://www.lawfoundation.org.nz/?p=10672\">funded a joint project</a> between OpenLaw NZ and researchers Tom Barraclough, Curtis Barnes and Warren Forster to apply automated technologies and analytics to case law to enhance access to justice.</p>\n\n<p>The core goal of the project is to develop automated tools that greatly reduce the time and expertise necessary to conduct legal research, both academic and practical. In short, as an output of the project, learnings that once would have required a team of legal researchers working many hours will be attainable by laypersons in a fraction of the time.</p>\n\n<p>This information will be accessible to the public, allowing them to engage with case law far more extensively than is presently the case. The possibilities that flow from this would be a significant breakthrough in access to justice and the democratization of law. </p>\n\n<p>OpenLaw NZ’s role will be to provide the technology and infrastructure, leveraging its existing open-source platform and expertise. Approximately 7,500 Court decisions about ACC cases will be used as the pilot dataset.</p>\n\n<p>Read the <a href=\"https://www.lawsociety.org.nz/practice-resources/the-business-of-law/access-to-justice/new-technology-aids-access-to-justice\">NZ Law Society Law Talk article about the project</a>. We will post updates as the project develops.</p>",
        "image_url": "https://s3-ap-southeast-2.amazonaws.com/assets.openlaw.nz/nzlf_logo_colour.jpg",
        "date": "2019-10-19T00:00:00+12:00",
        "formattedDate": "19 October 2019"
    },
    {
          "id": "2",
          "title": "OpenLaw NZ launches new website",
          "summary": "Welcome to our new website. We're really excited to release an improved web and mobile experience. We have also imported another 14,000 cases, and improved our data parsing technology.",
          "content_html": "<p>With the help of our awesome volunteer team, today we launch our website redesign!<\/p><p>The new website adds a much improved design and user interface. The site is also responsive, which makes it much easier to use on a mobile device. The search functionality has been upgraded to add pagination, and a new case display page.<\/p><p>We've also been working behind the scenes with our case law API and data pipeline. We have upgraded the API technology (including a new interface that allows you to explore API queries), added automatic extraction of Court information, overhauled our case to legislation algorithm, and migrated our database from mySQL to PostgreSQL.<\/p><p>All credit goes to our current volunteers: April Liau for the designs, Blaine Western leading the front end web team (including Caio Navarro, Tian Bai, and Hanbyul Son), our API expert Noel Soong, and our data parsing and devops volunteers Ed Haslam, Alex Chan, and Limei Wang.",
          "image_url": "https://s3-ap-southeast-2.amazonaws.com/assets.openlaw.nz/openlaw-full-logo.png",
          "date": "2019-09-11T00:00:00+12:00",
          "formattedDate": "13 September 2019"
      },
      {
          "id": "3",
          "title": "Amazing response to call for volunteers",
          "summary": "In July 2019, OpenLaw NZ put out a call for volunteers who would be interested in helping contribute to the platform. We sought front end web developers, people experienced with data parsing and machine learning, devops and infrastructure, design and law students or lawyers. The response was fantastic and we now have a team of 20 volunteers.",
          "content_html": "<p>In July 2019, OpenLaw NZ put out a call for volunteers who would be interested in helping contribute to the platform. We sought front end web developers, people experienced with data parsing and machine learning, devops and infrastructure, design and law students or lawyers.<\/p><p>The response has been fantastic. In three months, we’ve brought on a team of 20 committed volunteers, each with a set of skills and experience that has been invaluable in building additional functionality.<\/p><p>You can read more about our volunteers on our <a href=\"\/about\">about page.<\/a><\/p>",
          "image_url": "https://s3-ap-southeast-2.amazonaws.com/assets.openlaw.nz/volunteers_collage.png",
          "date": "2019-09-11T00:00:00+12:00",
          "formattedDate": "13 September 2019"
      }

    
  ]

}